In [1]:
import pandas as pd

In [ ]:
edades = [22, 32, 43, 58, 17, 19, 34, 29, 47, 55]

In [4]:
edades

[22, 32, 43, 58, 17, 19, 34, 29, 47, 55]

In [8]:
series = pd.Series(edades)

In [9]:
series

0    22
1    32
2    43
3    58
4    17
5    19
6    34
7    29
8    47
9    55
dtype: int64

In [11]:
series.head()

0    22
1    32
2    43
3    58
4    17
dtype: int64

In [12]:
series.tail(3)

7    29
8    47
9    55
dtype: int64

Obtener el valor minimo de la serie

In [14]:
series

0    22
1    32
2    43
3    58
4    17
5    19
6    34
7    29
8    47
9    55
dtype: int64

In [15]:
series.min()

np.int64(17)

In [17]:
series.max()

np.int64(58)

obtener el promedio

In [18]:
series.mean()

np.float64(35.6)

Obtener el valor de la segunda posicion

In [19]:
series[1]

np.int64(32)

In [20]:
series.get(2)

np.int64(43)

Obtener registro segun una condicion

In [22]:
series[series==22]

0    22
dtype: int64

Crear una segunda serie

In [25]:
edades2=[23,15,12,25,20,50,31,2]

In [26]:
series2=pd.Series(edades2)

In [27]:
series2

0    23
1    15
2    12
3    25
4    20
5    50
6    31
7     2
dtype: int64

In [28]:
series + series2

0    45.0
1    47.0
2    55.0
3    83.0
4    37.0
5    69.0
6    65.0
7    31.0
8     NaN
9     NaN
dtype: float64

Reeordenar la segunda serie con sort_index()

In [29]:
series2 = series2.sort_index(ascending=False)

series2

7     2
6    31
5    50
4    20
3    25
2    12
1    15
0    23
dtype: int64

In [30]:
series-5

0    17
1    27
2    38
3    53
4    12
5    14
6    29
7    24
8    42
9    50
dtype: int64

In [31]:
def cuadrado(x):
    return x**2

series.map(cuadrado)

0     484
1    1024
2    1849
3    3364
4     289
5     361
6    1156
7     841
8    2209
9    3025
dtype: int64

DATAFRAMES

In [32]:
datos = {
    "nombre": ["Argentina", "Brasil", "Chile", "Colombia", "Ecuador", "Peru"],
    "capital": ["Buenos Aires", "Brasilia", "Santiago", "Bogota", "Quito", "Lima"],
    "poblacion": [4538000, 212600000, 19120000, 50880000, 17640000, 32970000],
    "sup. en km2": [2780000, 8516000, 756100, 1142000, 283520, 1285220]
}

In [33]:
paises = pd.DataFrame(datos)
paises

      nombre       capital  poblacion  sup. en km2
0  Argentina  Buenos Aires    4538000      2780000
1     Brasil      Brasilia  212600000      8516000
2      Chile      Santiago   19120000       756100
3   Colombia        Bogota   50880000      1142000
4    Ecuador         Quito   17640000       283520
5       Peru          Lima   32970000      1285220

In [34]:
paises.head()

      nombre       capital  poblacion  sup. en km2
0  Argentina  Buenos Aires    4538000      2780000
1     Brasil      Brasilia  212600000      8516000
2      Chile      Santiago   19120000       756100
3   Colombia        Bogota   50880000      1142000
4    Ecuador         Quito   17640000       283520

In [36]:
paises.tail(3)

     nombre capital  poblacion  sup. en km2
3  Colombia  Bogota   50880000      1142000
4   Ecuador   Quito   17640000       283520
5      Peru    Lima   32970000      1285220

In [42]:
paises[1:4]

     nombre   capital  poblacion  sup. en km2
1    Brasil  Brasilia  212600000      8516000
2     Chile  Santiago   19120000       756100
3  Colombia    Bogota   50880000      1142000

In [37]:
paisesFilter = paises[["nombre", "poblacion"]]
paisesFilter

      nombre  poblacion
0  Argentina    4538000
1     Brasil  212600000
2      Chile   19120000
3   Colombia   50880000
4    Ecuador   17640000
5       Peru   32970000

In [43]:
paises2 = pd.DataFrame(datos, columns=["nombre", "poblacion"])
paises2

      nombre  poblacion
0  Argentina    4538000
1     Brasil  212600000
2      Chile   19120000
3   Colombia   50880000
4    Ecuador   17640000
5       Peru   32970000

In [45]:
nombrePaises = pd.DataFrame(datos, index=datos["nombre"], columns=["capital","poblacion", "sup. en km2"])
nombrePaises

                capital  poblacion  sup. en km2
Argentina  Buenos Aires    4538000      2780000
Brasil         Brasilia  212600000      8516000
Chile          Santiago   19120000       756100
Colombia         Bogota   50880000      1142000
Ecuador           Quito   17640000       283520
Peru               Lima   32970000      1285220

In [48]:
nombrePaises.loc["Argentina"]

capital        Buenos Aires
poblacion           4538000
sup. en km2         2780000
Name: Argentina, dtype: object

In [49]:
nombrePaises.loc[["Argentina", "Chile"], ["capital", "poblacion"]]

                capital  poblacion
Argentina  Buenos Aires    4538000
Chile          Santiago   19120000

In [52]:
nombrePaises.loc[nombrePaises["sup. en km2"] > 1000000]

                capital  poblacion  sup. en km2
Argentina  Buenos Aires    4538000      2780000
Brasil         Brasilia  212600000      8516000
Colombia         Bogota   50880000      1142000
Peru               Lima   32970000      1285220

In [54]:
nombrePaises.loc["Argentina", "capital"] = "CABA"
nombrePaises

            capital  poblacion  sup. en km2
Argentina      CABA    4538000      2780000
Brasil     Brasilia  212600000      8516000
Chile      Santiago   19120000       756100
Colombia     Bogota   50880000      1142000
Ecuador       Quito   17640000       283520
Peru           Lima   32970000      1285220

In [56]:
nombrePaises.iloc[2]

capital        Santiago
poblacion      19120000
sup. en km2      756100
Name: Chile, dtype: object

In [57]:
nombrePaises.iloc[:,1]

Argentina      4538000
Brasil       212600000
Chile         19120000
Colombia      50880000
Ecuador       17640000
Peru          32970000
Name: poblacion, dtype: int64

In [60]:
nombrePaises.iloc[[2,3], [1,2]]

          poblacion  sup. en km2
Chile      19120000       756100
Colombia   50880000      1142000

In [61]:
nombrePaises.columns

Index(['capital', 'poblacion', 'sup. en km2'], dtype='object')

In [62]:
nombrePaises.poblacion

Argentina      4538000
Brasil       212600000
Chile         19120000
Colombia      50880000
Ecuador       17640000
Peru          32970000
Name: poblacion, dtype: int64

In [63]:
nombrePaises.poblacion.values

array([  4538000, 212600000,  19120000,  50880000,  17640000,  32970000])

In [64]:
nombrePaises.poblacion.name

'poblacion'

In [65]:
nombrePaises.poblacion.min()

np.int64(4538000)

In [66]:
nombrePaises.poblacion.max()
nombrePaises.poblacion.std()

np.float64(78178779.0814532)

In [67]:
nombrePaises[["capital", "poblacion"]]

            capital  poblacion
Argentina      CABA    4538000
Brasil     Brasilia  212600000
Chile      Santiago   19120000
Colombia     Bogota   50880000
Ecuador       Quito   17640000
Peru           Lima   32970000

In [69]:
nombrePaises.loc[nombrePaises.poblacion > 5000000]

           capital  poblacion  sup. en km2
Brasil    Brasilia  212600000      8516000
Chile     Santiago   19120000       756100
Colombia    Bogota   50880000      1142000
Ecuador      Quito   17640000       283520
Peru          Lima   32970000      1285220

In [71]:
nombrePaises["Millones de Habitantes"] = nombrePaises.poblacion / 1000000
nombrePaises

            capital  poblacion  sup. en km2  Millones de Habitantes
Argentina      CABA    4538000      2780000                   4.538
Brasil     Brasilia  212600000      8516000                 212.600
Chile      Santiago   19120000       756100                  19.120
Colombia     Bogota   50880000      1142000                  50.880
Ecuador       Quito   17640000       283520                  17.640
Peru           Lima   32970000      1285220                  32.970